// Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]



int[] arr = new int[8];
for (int i = 0; i < 8; i++)
{
    var rnd = new Random();
    arr[i] = rnd.Next(0, 10);
    Console.Write(arr[i] + " ");
}

